-- 初期データを挿入
-- 建物情報
INSERT INTO locations (name, latitude, longitude) VALUES 
("タギタリウス館", 35.069752, 135.758382),
("真理館", 35.069401, 135.758543),
("天地館", 35.071381, 135.757953),
("4号館", 35.070718, 135.757250),
("5号館", 35.068495, 135.757425),
("10号館", 35.070643, 135.758098),
("11号館", 35.068170, 135.757367),
("12号館", 35.069529, 135.758212),
("13号館", 35.070082, 135.757433),
("14号館", 35.069285, 135.755707);


-- 授業スケジュール情報
INSERT INTO schedules (weekday, period, location_id, class_name) VALUES 
(3, 1, 1, "プログラミング演習B");
