-- 初期データを挿入
-- 建物情報
INSERT INTO locations (id, name, latitude, longitude) VALUES 
(1, "タギタリウス館", 35.069752, 135.758382),
(2, "真理館", 35.069401, 135.758543),
(3, "天地館", 35.071381, 135.757953),
(4, "4号館", 35.070718, 135.757250),
(5, "5号館", 35.068495, 135.757425),
(6, "10号館", 35.070643, 135.758098),
(7, "11号館", 35.068170, 135.757367),
(8, "12号館", 35.069529, 135.758212),
(9, "13号館", 35.070082, 135.757433),
(10, "14号館", 35.069285, 135.755707);


-- 授業スケジュール情報
INSERT INTO schedules (weekday, period, location_id, class_name) VALUES 
(3, 1, 6, "プログラミング演習B");


-- 授業がない日情報
INSERT INTO holidays (start_date, end_date, description) VALUES 
('2021-08-13', '2021-08-15', '夏季休暇'),
('2021-09-18', '2021-09-19', '教職員研修'),
('2025-03-01', '2021-03-20', '秋季休暇');
